In [45]:
import pandas as pd
import boto3
import json

In [46]:
import configparser
config = configparser.ConfigParser()
config.read_file(open('dwh.cfg'))

KEY                    = config.get('AWS','KEY')
SECRET                 = config.get('AWS','SECRET')

DWH_CLUSTER_TYPE       = config.get("CLUSTER","CLUSTER_TYPE")
DWH_NUM_NODES          = config.get("CLUSTER","NUM_NODES")
DWH_NODE_TYPE          = config.get("CLUSTER","NODE_TYPE")

DWH_CLUSTER_IDENTIFIER = config.get("CLUSTER","CLUSTER_IDENTIFIER")
DWH_DB                 = config.get("CLUSTER","DB_NAME")
DWH_DB_USER            = config.get("CLUSTER","DB_USER")
DWH_DB_PASSWORD        = config.get("CLUSTER","DB_PASSWORD")
DWH_PORT               = config.get("CLUSTER","DB_PORT")

DWH_IAM_ROLE_NAME      = config.get("IAM_ROLE", "IAM_ROLE_NAME")

(DWH_DB_USER, DWH_DB_PASSWORD, DWH_DB)

pd.DataFrame({"Param":
                  ["DWH_CLUSTER_TYPE", "DWH_NUM_NODES", "DWH_NODE_TYPE", "DWH_CLUSTER_IDENTIFIER", "DWH_DB", "DWH_DB_USER", "DWH_DB_PASSWORD", "DWH_PORT", "DWH_IAM_ROLE_NAME"],
              "Value":
                  [DWH_CLUSTER_TYPE, DWH_NUM_NODES, DWH_NODE_TYPE, DWH_CLUSTER_IDENTIFIER, DWH_DB, DWH_DB_USER, DWH_DB_PASSWORD, DWH_PORT, DWH_IAM_ROLE_NAME]
             })

                    Param            Value
0  DWH_CLUSTER_TYPE        multi-node
1  DWH_NUM_NODES           4
2  DWH_NODE_TYPE           dc2.large
3  DWH_CLUSTER_IDENTIFIER  sparkifyCluster
4  DWH_DB                  sparkifydb
5  DWH_DB_USER             samiramunir
6  DWH_DB_PASSWORD         spArk1f!
7  DWH_PORT                5439
8  DWH_IAM_ROLE_NAME       sparkify_role

In [47]:
ec2 = boto3.resource('ec2',
                       region_name = "us-west-2",
                       aws_access_key_id=KEY,
                       aws_secret_access_key =SECRET
                    )

s3 = boto3.resource('s3',
                       region_name = "us-west-2",
                       aws_access_key_id=KEY,
                       aws_secret_access_key =SECRET
                    )

iam = boto3.client('iam',
                        region_name = "us-west-2",
                        aws_access_key_id=KEY,
                        aws_secret_access_key=SECRET)

redshift = boto3.client('redshift',
                             region_name="us-west-2",
                             aws_access_key_id=KEY,
                             aws_secret_access_key=SECRET)

In [48]:
s3.Bucket

In [49]:
# sampleDbBucket =  s3.Bucket("udacity-dend")
# 's3://udacity-dend/log-data'
# # TODO: Iterate over bucket objects starting with "ssbgz" and print
# for obj in sampleDbBucket.objects.filter(Prefix="log-data/2018/11"):
#     print(obj)

In [50]:
# TODO: Create the IAM role
try:
    print('1.1 Creating a new IAM Role')
    dwhRole = iam.create_role(
        Path='/',
        RoleName=DWH_IAM_ROLE_NAME,
        Description = "Allows Redshift clusters to call AWS services on your behalf.",
        AssumeRolePolicyDocument=json.dumps(
            {'Statement': [{'Action': 'sts:AssumeRole',
               'Effect': 'Allow',
               'Principal': {'Service': 'redshift.amazonaws.com'}}],
             'Version': '2012-10-17'})
    )

    

except Exception as e:
    print(e)

1.1 Creating a new IAM Role
An error occurred (EntityAlreadyExists) when calling the CreateRole operation: Role with name sparkify_role already exists.

In [51]:
# TODO: Attach Policy
print('1.2 Attaching Policy')
iam.attach_role_policy(RoleName=DWH_IAM_ROLE_NAME,
                       PolicyArn="arn:aws:iam::aws:policy/AmazonS3ReadOnlyAccess"
                      )['ResponseMetadata']['HTTPStatusCode']

1.2 Attaching Policy

200

In [52]:
# TODO: Get and print the IAM role ARN
print("1.3 Get the IAM role ARN")
roleArn = iam.get_role(RoleName=DWH_IAM_ROLE_NAME)['Role']['Arn']

print(roleArn)

1.3 Get the IAM role ARN
arn:aws:iam::358787457894:role/sparkify_role

In [34]:
try:
    response = redshift.create_cluster(        
        #HW
        ClusterType=DWH_CLUSTER_TYPE,
        NodeType=DWH_NODE_TYPE,
        NumberOfNodes=int(DWH_NUM_NODES),

        #Identifiers & Credentials
        DBName=DWH_DB,
        ClusterIdentifier=DWH_CLUSTER_IDENTIFIER,
        MasterUsername=DWH_DB_USER,
        MasterUserPassword=DWH_DB_PASSWORD,
        
        #Roles (for s3 access)
        IamRoles=[roleArn]   
    )
except Exception as e:
    print(e)

In [53]:
def prettyRedshiftProps(props):
    pd.set_option('display.max_colwidth', -1)
    keysToShow = ["ClusterIdentifier", "NodeType", "ClusterStatus", "MasterUsername", "DBName", "Endpoint", "NumberOfNodes", 'VpcId']
    x = [(k, v) for k,v in props.items() if k in keysToShow]
    return pd.DataFrame(data=x, columns=["Key", "Value"])

myClusterProps = redshift.describe_clusters(ClusterIdentifier=DWH_CLUSTER_IDENTIFIER)['Clusters'][0]
prettyRedshiftProps(myClusterProps)

,Key,Value
0,ClusterIdentifier,sparkifycluster
1,NodeType,dc2.large
2,ClusterStatus,available
3,MasterUsername,samiramunir
4,DBName,sparkifydb
5,Endpoint,"{'Address': 'sparkifycluster.ccriwkzpy85h.us-west-2.redshift.amazonaws.com', 'Port': 5439}"
6,VpcId,vpc-a64ae1de
7,NumberOfNodes,4

In [54]:
#!!!! RUN AFTER THE CLUsTERSTATUS turns to available
DWH_ENDPOINT = myClusterProps['Endpoint']['Address']
DWH_ROLE_ARN = myClusterProps['IamRoles'][0]['IamRoleArn']
print("DWH_ENDPOINT :: ", DWH_ENDPOINT)
print("DWH_ROLE_ARN :: ", DWH_ROLE_ARN)

DWH_ENDPOINT ::  sparkifycluster.ccriwkzpy85h.us-west-2.redshift.amazonaws.com
DWH_ROLE_ARN ::  arn:aws:iam::358787457894:role/sparkify_role

In [24]:
try:
    vpc = ec2.Vpc(id=myClusterProps['VpcId'])
    defaultSg = list(vpc.security_groups.all())[0]
    print(defaultSg)
    defaultSg.authorize_ingress(
        GroupName=defaultSg.group_name,
        CidrIp='0.0.0.0/0',
        IpProtocol='TCP',
        FromPort=int(DWH_PORT),
        ToPort=int(DWH_PORT)
    )
except Exception as e:
    print(e)

ec2.SecurityGroup(id='sg-63a4072e')
An error occurred (InvalidPermission.Duplicate) when calling the AuthorizeSecurityGroupIngress operation: the specified rule "peer: 0.0.0.0/0, TCP, from port: 5439, to port: 5439, ALLOW" already exists

In [55]:
import os 
%load_ext sql
conn_string="postgresql://{}:{}@{}:{}/{}".format(DWH_DB_USER, DWH_DB_PASSWORD, DWH_ENDPOINT, DWH_PORT,DWH_DB)
print(conn_string)
%sql $conn_string

The sql extension is already loaded. To reload it, use:
  %reload_ext sql
postgresql://samiramunir:spArk1f!@sparkifycluster.ccriwkzpy85h.us-west-2.redshift.amazonaws.com:5439/sparkifydb

'Connected: samiramunir@sparkifydb'

In [39]:
from create_tables import *
main()

In [15]:
%sql SELECT * from staging_events limit 1

 * postgresql://samiramunir:***@sparkifycluster.ccriwkzpy85h.us-west-2.redshift.amazonaws.com:5439/sparkifydb
0 rows affected.

[]

In [16]:
%sql SELECT * from staging_songs limit 1

 * postgresql://samiramunir:***@sparkifycluster.ccriwkzpy85h.us-west-2.redshift.amazonaws.com:5439/sparkifydb
0 rows affected.

[]

In [40]:
from time import time

from etl import *

In [41]:
%%time
main()

CPU times: user 9.88 ms, sys: 7.22 ms, total: 17.1 ms
Wall time: 3min 19s

In [42]:
%sql SELECT count(*) from staging_songs;

 * postgresql://samiramunir:***@sparkifycluster.ccriwkzpy85h.us-west-2.redshift.amazonaws.com:5439/sparkifydb
1 rows affected.

[(14896,)]

In [43]:
%sql SELECT count(*) from staging_events;

 * postgresql://samiramunir:***@sparkifycluster.ccriwkzpy85h.us-west-2.redshift.amazonaws.com:5439/sparkifydb
1 rows affected.

[(8056,)]

In [12]:
%sql SELECT * from staging_songs limit 5;

 * postgresql://samiramunir:***@sparkifycluster.ccriwkzpy85h.us-west-2.redshift.amazonaws.com:5439/sparkifydb
5 rows affected.

[('ARPIKA31187FB4C233', Decimal('40'), 'New York', Decimal('-74'), 'The Action', Decimal('180'), 1, 'SOPVNTL12AB01854F9', 'Brain', 0),
 ('AREJC2N1187FB555F9', None, '', None, 'Dare', Decimal('269'), 1, 'SOXZSFM12A6D4F8477', 'Runaway', 0),
 ('ARYPTWE1187FB49D64', None, '', None, 'Polygon Window', Decimal('280'), 1, 'SODVIBY12AB0186823', 'Audax Powder', 0),
 ('ARVTBDO1187B98AA00', None, 'Athens, GA', None, 'Madeleine Peyroux', Decimal('178'), 1, 'SOLYRRS12A58A7BF91', "J'Ai Deux Amours", 2004),
 ('ARD0FN11187B9B25CD', Decimal('40'), 'New York, NY [The Bronx]', Decimal('-73'), 'Bobby Darin', Decimal('163'), 1, 'SOWOHNT12A6D4F60EA', '(I Heard That) Lonesome Whistle', 1995)]

In [22]:
%sql SELECT * from staging_events limit 5;

 * postgresql://samiramunir:***@sparkifycluster.ccriwkzpy85h.us-west-2.redshift.amazonaws.com:5439/sparkifydb
5 rows affected.

[('Hoobastank', 'Logged In', 'Cierra', 'F', 0, 'Finley', Decimal('241'), 'free', 'Richmond, VA', 'PUT', 'NextSong', '1541013292796', 132, 'Say The Same', 200, datetime.datetime(2018, 11, 10, 0, 15, 27, 796000), '"Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4) AppleWebKit/537.77.4 (KHTML, like Gecko) Version/7.0.5 Safari/537.77.4"', '96'),
 ('Mark Knopfler', 'Logged In', 'Cierra', 'F', 1, 'Finley', Decimal('249'), 'free', 'Richmond, VA', 'PUT', 'NextSong', '1541013292796', 132, 'Why Aye Man', 200, datetime.datetime(2018, 11, 10, 0, 19, 28, 796000), '"Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4) AppleWebKit/537.77.4 (KHTML, like Gecko) Version/7.0.5 Safari/537.77.4"', '96'),
 ('Mogwai', 'Logged In', 'Cierra', 'F', 2, 'Finley', Decimal('341'), 'free', 'Richmond, VA', 'PUT', 'NextSong', '1541013292796', 132, "We're No Here", 200, datetime.datetime(2018, 11, 10, 0, 23, 37, 796000), '"Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4) AppleWebKit/537.77.4 (KHTML, like Gecko) Version/7.0.5 Safari/537.77.4"', '96'),
 ('The Casualties', 'Logged In', 'Cierra', 'F', 3, 'Finley', Decimal('181'), 'free', 'Richmond, VA', 'PUT', 'NextSong', '1541013292796', 132, 'Punx Unite', 200, datetime.datetime(2018, 11, 10, 0, 29, 18, 796000), '"Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4) AppleWebKit/537.77.4 (KHTML, like Gecko) Version/7.0.5 Safari/537.77.4"', '96'),
 (None, 'Logged In', 'Cecilia', 'F', 0, 'Owens', None, 'free', 'Atlanta-Sandy Springs-Roswell, GA', 'GET', 'Home', '1541032432796', 424, None, 200, datetime.datetime(2018, 11, 10, 1, 33, 55, 796000), 'Mozilla/5.0 (Windows NT 6.1; WOW64; rv:32.0) Gecko/20100101 Firefox/32.0', '6')]

In [49]:

%sql SELECT DISTINCT(concat(user_id, cast(ts AS VARCHAR))) AS ID, ts from staging_events WHERE page = 'NextSong'limit 2;

 * postgresql://samiramunir:***@sparkifycluster.ccriwkzpy85h.us-west-2.redshift.amazonaws.com:5439/sparkifydb
2 rows affected.

[('262018-11-15 00:30:26.796', datetime.datetime(2018, 11, 15, 0, 30, 26, 796000)),
 ('262018-11-15 00:41:21.796', datetime.datetime(2018, 11, 15, 0, 41, 21, 796000))]

In [19]:
%sql SELECT count(*) from (SELECT distinct(user_id) from staging_events);

 * postgresql://samiramunir:***@sparkifycluster.ccriwkzpy85h.us-west-2.redshift.amazonaws.com:5439/sparkifydb
1 rows affected.

[(98,)]

In [7]:
%sql SELECT level, count(level) from staging_events group by level;

 * postgresql://samiramunir:***@sparkifycluster.ccriwkzpy85h.us-west-2.redshift.amazonaws.com:5439/sparkifydb
2 rows affected.

[('free', 1765), ('paid', 6291)]

In [19]:
%sql drop table if exists users;

 * postgresql://samiramunir:***@sparkifycluster.ccriwkzpy85h.us-west-2.redshift.amazonaws.com:5439/sparkifydb
Done.

[]

In [20]:
%%sql
CREATE TABLE users (
        user_id         INT PRIMARY KEY SORTKEY DISTKEY,
        first_name      VARCHAR,
        last_name       VARCHAR,
        gender          VARCHAR,
        level           VARCHAR NOT NULL,
        ts_date            DATE)
    DISTSTYLE KEY;

 * postgresql://samiramunir:***@sparkifycluster.ccriwkzpy85h.us-west-2.redshift.amazonaws.com:5439/sparkifydb
Done.

[]

In [21]:
%sql select * from users limit 1;

 * postgresql://samiramunir:***@sparkifycluster.ccriwkzpy85h.us-west-2.redshift.amazonaws.com:5439/sparkifydb
0 rows affected.

[]

In [57]:
from sql_queries import user_table_insert
import psycopg2

host        = config.get("CLUSTER","HOST")
dbname      = config.get("CLUSTER","DB_NAME")
user        = config.get("CLUSTER","DB_USER")
password    = config.get("CLUSTER","DB_PASSWORD")
port        = config.get("CLUSTER","DB_PORT")

conn = psycopg2.connect("host={} dbname={} user={} password={} port={}".format(host,
                                                                                   dbname,
                                                                                   user,
                                                                                   password,
                                                                             port))

cur = conn.cursor()

query =  user_table_insert
query = ("""

BEGIN TRANSACTION;

INSERT INTO users
            SELECT * FROM
                        (SELECT     DISTINCT(user_id)     AS user_id,
                                    first_name            AS first_name,
                                    last_name             AS last_name,
                                    gender                AS gender,
                                    level                 AS level,
                                    TRUNC(ts)             AS ts_date
                         FROM staging_events
                         where staging_events.level = 'free'
                         AND user_id is NOT NULL);

CREATE temp table stage (like users);

INSERT INTO stage
            SELECT * FROM
                        (SELECT     DISTINCT(user_id)     AS user_id,
                                    first_name            AS first_name,
                                    last_name             AS last_name,
                                    gender                AS gender,
                                    level                 AS level,
                                    TRUNC(ts)             AS ts_date
                         FROM staging_events
                         where staging_events.level = 'paid'
                         AND user_id IS NOT NULL);

DELETE from stage
USING users
WHERE
    stage.user_id = users.user_id
    AND
    stage.ts_date < users.ts_date;
    
DELETE from users
USING stage
WHERE
    stage.user_id = users.user_id
    AND
    stage.ts_date > users.ts_date;

INSERT INTO USERS
SELECT * FROM stage;

ALTER TABLE users DROP COLUMN ts_date;

END transaction;

DROP TABLE IF EXISTS stage;

""")

query = ("""

INSERT INTO users
SELECT  s3.user_id, s3.first_name, s3.last_name, s3.gender, s3.level
FROM (SELECT s1.user_id, s1.first_name, s1.last_name, s1.gender, s1.level, s1.ts
        FROM staging_events s1
        JOIN (SELECT user_id, MAX(ts) AS ts 
              FROM staging_events
              GROUP BY user_id) AS s2
        ON   s1.user_id = s2.user_id 
        AND  s1.ts = s2.ts) AS s3 ;

""")

try: 
    cur.execute(query)
except Exception as e: 
    print(e)

conn.close()

In [ ]:
"""
SELECT  user_id, first_name, first_name, last_name, gender, level 
FROM (SELECT user_id, first_name, last_name, gender, level, ts
        FROM staging_events s1
        JOIN (SELECT user_id, MAX(ts) AS ts 
              FROM staging_events
              GROUP BY user_id) AS s2
        ON   s1.user_id = s2.user_id 
        AND  s1.ts = s2.ts);

"""


query = ("""

BEGIN TRANSACTION;

CREATE temp table users2 (like staging_events);

INSERT INTO users2
            SELECT * FROM staging_events 
            
             where staging_events.level = 'free'
             AND user_id is NOT NULL
                        (SELECT     DISTINCT(user_id)     AS user_id,
                                    first_name            AS first_name,
                                    last_name             AS last_name,
                                    gender                AS gender,
                                    level                 AS level,
                                    TRUNC(ts)             AS ts_date
                         FROM staging_events
                         where staging_events.level = 'free'
                         AND user_id is NOT NULL);

CREATE temp table stage (like users);

INSERT INTO stage
            SELECT * FROM
                        (SELECT     DISTINCT(user_id)     AS user_id,
                                    first_name            AS first_name,
                                    last_name             AS last_name,
                                    gender                AS gender,
                                    level                 AS level,
                                    TRUNC(ts)             AS ts_date
                         FROM staging_events
                         where staging_events.level = 'paid'
                         AND user_id IS NOT NULL);

DELETE from stage
USING users
WHERE
    stage.user_id = users.user_id
    AND
    stage.ts_date < users.ts_date;
    
DELETE from users
USING stage
WHERE
    stage.user_id = users.user_id
    AND
    stage.ts_date > users.ts_date;

INSERT INTO USERS
SELECT * FROM stage;

ALTER TABLE users DROP COLUMN ts_date;

END transaction;

DROP TABLE IF EXISTS stage;

""")

In [59]:
%%sql 
select count(*) from 
(select s1.artist_id, s1.artist_name from staging_songs s1
join 
(SELECT artist_id, count(artist_longitude) AS number 
              FROM staging_songs 
              GROUP BY artist_id) as s2
              ON s1.artist_id = s2.artist_id);

 * postgresql://samiramunir:***@sparkifycluster.ccriwkzpy85h.us-west-2.redshift.amazonaws.com:5439/sparkifydb
1 rows affected.

[(14896,)]

In [67]:
%%sql 
select count(*) FROM (

                        select s1.artist_id 
                            FROM staging_songs s1
                            JOIN 
                                (SELECT artist_id, MAX(duration) AS duration
                                      FROM staging_songs 
                                      GROUP BY artist_id) as s2
                            ON s1.artist_id = s2.artist_id
                            AND s1.duration = s2.duration
) 
;

 * postgresql://samiramunir:***@sparkifycluster.ccriwkzpy85h.us-west-2.redshift.amazonaws.com:5439/sparkifydb
1 rows affected.

[(9576,)]

In [ ]:
%SQL select count(*) FROM

In [25]:
%%sql
SELECT COUNT(*) FROM
(SELECT     DISTINCT(user_id)     AS user_id,
                                    first_name            AS first_name,
                                    last_name             AS last_name,
                                    gender                AS gender,
                                    level                 AS level
                         FROM staging_events
                         where staging_events.level = 'free'
                            AND user_id IS NOT NULL);

 * postgresql://samiramunir:***@sparkifycluster.ccriwkzpy85h.us-west-2.redshift.amazonaws.com:5439/sparkifydb
1 rows affected.

[(83,)]

In [46]:
%%sql
SELECT     DISTINCT(user_id)     AS user_id,
                                    first_name            AS first_name,
                                    last_name             AS last_name,
                                    gender                AS gender,
                                    level                 AS level,
                                    TRUNC(ts)             AS date
                                    
                         FROM staging_events 
                            where staging_events.level = 'paid'
                            AND user_id IS NOT NULL
                            limit 20;

 * postgresql://samiramunir:***@sparkifycluster.ccriwkzpy85h.us-west-2.redshift.amazonaws.com:5439/sparkifydb
20 rows affected.

[(95, 'Sara', 'Johnson', 'F', 'paid', datetime.date(2018, 11, 3)),
 (15, 'Lily', 'Koch', 'F', 'paid', datetime.date(2018, 11, 3)),
 (44, 'Aleena', 'Kirby', 'F', 'paid', datetime.date(2018, 11, 11)),
 (20, 'Aiden', 'Ramirez', 'M', 'paid', datetime.date(2018, 11, 8)),
 (44, 'Aleena', 'Kirby', 'F', 'paid', datetime.date(2018, 11, 10)),
 (95, 'Sara', 'Johnson', 'F', 'paid', datetime.date(2018, 11, 14)),
 (80, 'Tegan', 'Levine', 'F', 'paid', datetime.date(2018, 11, 14)),
 (25, 'Jayden', 'Graves', 'M', 'paid', datetime.date(2018, 11, 13)),
 (29, 'Jacqueline', 'Lynch', 'F', 'paid', datetime.date(2018, 11, 8)),
 (80, 'Tegan', 'Levine', 'F', 'paid', datetime.date(2018, 11, 8)),
 (44, 'Aleena', 'Kirby', 'F', 'paid', datetime.date(2018, 11, 13)),
 (97, 'Kate', 'Harrell', 'F', 'paid', datetime.date(2018, 11, 13)),
 (80, 'Tegan', 'Levine', 'F', 'paid', datetime.date(2018, 11, 15)),
 (15, 'Lily', 'Koch', 'F', 'paid', datetime.date(2018, 11, 15)),
 (49, 'Chloe', 'Cuevas', 'F', 'paid', datetime.date(2018, 11, 15)),
 (30, 'Avery', 'Watkins', 'F', 'paid', datetime.date(2018, 11, 15)),
 (29, 'Jacqueline', 'Lynch', 'F', 'paid', datetime.date(2018, 11, 13)),
 (36, 'Matthew', 'Jones', 'M', 'paid', datetime.date(2018, 11, 10)),
 (30, 'Avery', 'Watkins', 'F', 'paid', datetime.date(2018, 11, 6)),
 (72, 'Hayden', 'Brock', 'F', 'paid', datetime.date(2018, 11, 8))]

In [43]:
#### CAREFUL!!
#-- Uncomment & run to delete the created resources
redshift.delete_cluster( ClusterIdentifier=DWH_CLUSTER_IDENTIFIER,  SkipFinalClusterSnapshot=True)
#### CAREFUL!!

{'Cluster': {'ClusterIdentifier': 'sparkifycluster',
  'NodeType': 'dc2.large',
  'ClusterStatus': 'deleting',
  'MasterUsername': 'samiramunir',
  'DBName': 'sparkifydb',
  'Endpoint': {'Address': 'sparkifycluster.ccriwkzpy85h.us-west-2.redshift.amazonaws.com',
   'Port': 5439},
  'ClusterCreateTime': datetime.datetime(2019, 5, 31, 18, 3, 24, 829000, tzinfo=tzutc()),
  'AutomatedSnapshotRetentionPeriod': 1,
  'ManualSnapshotRetentionPeriod': -1,
  'ClusterSecurityGroups': [],
  'VpcSecurityGroups': [],
  'ClusterParameterGroups': [{'ParameterGroupName': 'default.redshift-1.0',
    'ParameterApplyStatus': 'in-sync'}],
  'ClusterSubnetGroupName': 'default',
  'VpcId': 'vpc-a64ae1de',
  'AvailabilityZone': 'us-west-2d',
  'PreferredMaintenanceWindow': 'tue:11:00-tue:11:30',
  'PendingModifiedValues': {},
  'ClusterVersion': '1.0',
  'AllowVersionUpgrade': True,
  'NumberOfNodes': 4,
  'PubliclyAccessible': True,
  'Encrypted': False,
  'Tags': [],
  'EnhancedVpcRouting': False,
  'IamRoles': [{'IamRoleArn': 'arn:aws:iam::358787457894:role/sparkify_role',
    'ApplyStatus': 'in-sync'}],
  'MaintenanceTrackName': 'current',
  'DeferredMaintenanceWindows': []},
 'ResponseMetadata': {'RequestId': 'a30104f9-83d0-11e9-905e-a5c1e9a1b7c9',
  'HTTPStatusCode': 200,
  'HTTPHeaders': {'x-amzn-requestid': 'a30104f9-83d0-11e9-905e-a5c1e9a1b7c9',
   'content-type': 'text/xml',
   'content-length': '2068',
   'vary': 'Accept-Encoding',
   'date': 'Fri, 31 May 2019 18:19:32 GMT'},
  'RetryAttempts': 0}}